def linear_search (array, searched_element):
    answer = None
    for i in range (len(array)):
        if searched_element == array[i]:
            answer = i+1
    return answer
 
Authors = ["Пушкин", "Лермонтов", "Толстой", "Шолохов", "Маяковский", "Тютчев", "Есенин", "Фет", "Некрасов", "Цветаева", "Грибоедов", "Гоголь", "Чехов", "Достоевский",
           "Тургенев", "Островский", "Гончаров", "Салтыков-Щедрин", "Носов", "Твардовский", "Чуковский", "Державин", "Ломоносов", "Блок", "Булгаков", "Пастерак", "Бунин", "Горький",
           "Паустовский", "Карамзин", "Беляев", "Лесков", "Каверин", "Ахматова", "Гумелёв"]
Author = input("Введите фамилию автора: ")

print(linear_search(Authors, Author))

a = linear_search(Authors, Author)

if a != None:
    print ("Номер автора -", a)
else:
    print("На полке нет книги, указанного автора")